app/Http/Controllers/CustomerController.php

    public function index(){
        $customers = Customer::with('orders')->paginate(10);
---
select * from `customers` limit 10 offset 0
select * from `orders` where `orders`.`customer_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10) and `orders`.`deleted_at` is null
select count(*) as aggregate from `customers`