app/Http/Controllers/OrderController.php

    public function index(){
        //$orders = Order::with('customer')->paginate(5);
        $page = Request::get('page', 1); // current page or default to 1
        $cacheKey = "orders_page_{$page}";

        // Track keys manually
        $trackedKeys = Cache::get('orders_cache_keys', []);
        if (!in_array($cacheKey, $trackedKeys)) {
            $trackedKeys[] = $cacheKey;
            Cache::put('orders_cache_keys', $trackedKeys, now()->addMinutes(10));
        }
        //dd($trackedKeys);
        $orders = Cache::remember($cacheKey, now()->addMinutes(5), function () {
            return Order::with('customer')->paginate(5);
---
select * from `customers` where `customers`.`id` in (31, 32, 33, 34, 35)
select * from `orders` where `orders`.`deleted_at` is null limit 5 offset 0
select count(*) as aggregate from `orders` where `orders`.`deleted_at` is null